<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Eko</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.Eko</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Eko</string>
    </dict>
    <key>MinimumVersion</key>
    <string></string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>https://desktop.ekoapp.com/ekos/updates/latest/mac/Eko.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Eko.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
